python_proj/Resolve_Ticket_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://xml.comcast.com/sams/tts/affectedelement/v1_11">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-97041632" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>Watchtower_NCD</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">4kC+LaEUrp0Zdr4fEslvYN/S9FA=</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MjM1MDIyNTA3Nw==</wsse:Nonce>
                <wsu:Created>2017-08-14T17:45:00.000Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <v1:update>
            <v1:UpdateAffectedElement>
                <Header>
                    <Requester>Watchtower</Requester>
                    <Submitter>
                        <Type>Remedy</Type>
                        <Value>Watchtower</Value>
                    </Submitter>
                    <TimeStamp>
                        <Date>2017-08-14</Date>
                        <Time>17:45:01</Time>
                        <TimeZone>UTC</TimeZone>
                    </TimeStamp>
                    <TransactionId>83643821577762436454</TransactionId>
                </Header>
                <Body>
                    <Action>Update</Action>
                    <AffectedElement>
                        <AffectedElementId>OE072932045</AffectedElementId>
                        <ActualEnd>
                            <Date>2017-08-14</Date>
                            <Time>17:41:35</Time>
                            <TimeZone>GMT</TimeZone>
                        </ActualEnd>
                        <CauseCode>149</CauseCode>
                        <SolutionCode>2304</SolutionCode>
                        <Status>Close</Status>
                    </AffectedElement>
                </Body>
            </v1:UpdateAffectedElement>
        </v1:update>
    </soapenv:Body>
</soapenv:Envelope>